---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.TypePanelsFronNonRectCellsUnlocked
source: html/14ce6ee2-999d-0221-c008-725016fc6de4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.TypePanelsFronNonRectCellsUnlocked Property

Loaded family curtain panels cannot be used in non-rectangular cells of the curtain host. Type-driven panels from non-rectangular cells were unlocked and left unchanged.

## Syntax (C#)
```csharp
public static FailureDefinitionId TypePanelsFronNonRectCellsUnlocked { get; }
```